--负责特殊怪物放置, 例如巡逻怪,倒挂蝙蝠等

--示例
--SetCurMap("garner")
--cha = CreateCha(37, 50000, 30000)  --在指定位置(出生点)创建怪物
--SetChaPatrol(cha, 500300, 300200)  --指定怪物的巡逻点, 怪物会在出生点和巡逻点之间巡逻
--SetChaFaceAngle(cha, 90)           --设置创建出来的怪物面向角度

SetCurMap("starwalkway")

--添加天气区域
--7个参数 : 
--地面状态编号
--随机产生的时间间隔(单位:秒)
--产生之后状态持续的时间(单位:秒)
--天气范围起始坐标x, y(单位:米)
--天气范围宽度,高度(单位:米)
AddWeatherRegion(9,  8, 40, 2434, 2800 , 80, 80)--白银
AddWeatherRegion(11, 8, 40, 2247, 2960 , 80, 80)


AddWeatherRegion(9,  8, 40, 1190, 1140 , 80, 80)--雷霆
AddWeatherRegion(11, 8, 40, 1160, 1400 , 80, 80)


--莎拉曼达
CreateCha(1294, 9700, 35500, 145, 10800)
CreateCha(1294, 13200, 2800, 145, 10800)

CreateCha(1298, 7000, 22300, 145, 10800)
CreateCha(1298, 14600, 3900, 145, 10800)


CreateCha(1299, 7700, 11900, 145, 10800)
CreateCha(1299, 14700, 2800, 145, 10800)

CreateCha(1303, 8100, 8300, 145, 10800)
CreateCha(1303, 12600 , 1700, 145, 10800)

CreateCha(1308, 14800, 2900, 145, 43200)